docs: update to the arch diagram docs
